import { TDate } from "../types/date";

export const data: TDate[] = [
  {
    id: 1,
    category: "Технологии",
    startYear: 1980,
    endYear: 1986,
    events: [
      {
        id: 1,
        year: 1981,
        description:
          "IBM представила первый персональный компьютер — IBM 5150, более известный как IBM PC",
      },
      {
        id: 2,
        year: 1982,
        description:
          "Sony и Philips выпустили первые коммерческие компакт-диски и проигрыватели",
      },
      {
        id: 3,
        year: 1983,
        description:
          "Появился первый коммерческий мобильный телефон — Motorola DynaTAC 8000X",
      },
      {
        id: 4,
        year: 1984,
        description:
          "Apple выпустила Macintosh — первый массовый компьютер с графическим интерфейсом и мышью",
      },
      {
        id: 5,
        year: 1985,
        description:
          "Компания Commodore выпустила Amiga 1000 — мультимедийный компьютер с продвинутой графикой и звуком",
      },
      {
        id: 6,
        year: 1985,
        description:
          "Microsoft выпустила первую версию Windows — графическую оболочку для MS-DOS",
      },
    ],
  },
  {
    id: 2,
    category: "Кино",
    startYear: 1987,
    endYear: 1991,
    events: [
      {
        id: 1,
        year: 1987,
        description:
          "Выход Робокопа. Это был не просто боевик, а мрачная антиутопия с сатирой на корпорации, СМИ и общество",
      },
      {
        id: 2,
        year: 1988,
        description:
          "Победа «Последнего императора» на «Оскаре». Фильм был снят с разрешения китайского правительства внутри Запретного города, что тогда было практически невозможно.",
      },
      {
        id: 3,
        year: 1989,
        description:
          "Начало разработки CGI для «Парк юрского периода». Это был первый фильм, в котором использовалось CGI",
      },
      {
        id: 4,
        year: 1989,
        description:
          "Расцвет анимации: выход Русалочки. Открыла Disney Renaissance — десятилетие выдающихся мультфильмов («Король Лев», «Аладдин», «Красавица и Чудовище» и др.)",
      },
      {
        id: 5,
        year: 1990,
        description:
          "Выход Славных парней. Новаторская подача гангстерской драмы с динамичным монтажом, «ломкой четвёртой стены» и культовым стилем повествования",
      },
      {
        id: 6,
        year: 1991,
        description:
          "Появление «Терминатор 2: Судный день». Первый фильм, где CGI-протагонист (T-1000) стал полноценным персонажем",
      },
    ],
  },
  {
    id: 3,
    category: "Литература",
    startYear: 1992,
    endYear: 1997,
    events: [
      {
        id: 1,
        year: 1992,
        description:
          "Выход «Снегопада» Нила Стивенсона в США",
      },
      {
        id: 2,
        year: 1993,
        description:
          "Популярность «Интервью с вампиром»",
      },
      {
        id: 3,
        year: 1995,
        description:
          "Рост книжных сетей и появление Amazon",
      },
      {
        id: 4,
        year: 1995,
        description:
          "К 1995 году Харуки Мураками стал знаковой мировой фигурой: романы «Норвежский лес», «Дэнс, Дэнс, Дэнс», «Хроники заводной птицы» переводились и широко читались",
      },
      {
        id: 5,
        year: 1996,
        description:
          "Успех «Игры престолов» — первой книги цикла «Песнь льда и пламени»",
      },
      {
        id: 6,
        year: 1997,
        description:
          "Публикация «Гарри Поттера и философского камня»",
      },
    ],
  },
  {
    id: 4,
    category: "Спорт",
    startYear: 1998,
    endYear: 2005,
    events: [
      {
        id: 1,
        year: 1998,
        description:
          "Франция впервые в истории стала чемпионом мира, победив Бразилию 3:0",
      },
      {
        id: 2,
        year: 1998,
        description:
          "В хоккее впервые участвовали игроки НХЛ, в том числе Уэйн Гретцки, Доминик Гашек",
      },
      {
        id: 3,
        year: 1999,
        description:
          "Manchester United выиграл Английскую Премьер-лигу, Кубок Англии и Лигу чемпионов за один сезон",
      },
      {
        id: 4,
        year: 2002,
        description:
          "Выход в НБА Яо Мина. Первый по-настоящему глобальный суперзвезда из Азии в американском спорте",
      },
      {
        id: 5,
        year: 2004,
        description:
          "Олимпиада в Афинах — возвращение на родину. Игры прошли в стране, где они зародились",
      },
      {
        id: 6,
        year: 2005,
        description:
          "Начало эры Роджера Федерера. Он выиграл 3 из 4 турниров «Большого шлема» в 2005 году",
      },
    ],
  },
  {
    id: 5,
    category: "Космонавтика",
    startYear: 2006,
    endYear: 2014,
    events: [
      {
        id: 1,
        year: 2006,
        description:
          "Запуск первого спутника миссии «Новые горизонты» к Плутону",
      },
      {
        id: 2,
        year: 2008,
        description:
          "Первый успешный запуск ракеты Falcon 1 от SpaceX",
      },
      {
        id: 3,
        year: 2009,
        description:
          "Начало работы спутниковой системы ГЛОНАСС в России",
      },
      {
        id: 4,
        year: 2011,
        description:
          "Сборка и запуск последнего модуля МКС",
      },
      {
        id: 5,
        year: 2012,
        description:
          "Первый частный корабль пристыковался к МКС (Dragon)",
      },
      {
        id: 6,
        year: 2014,
        description:
          "Высадка зонда Rosetta на комету Чурюмова–Герасименко",
      },
    ],
  },
  {
    id: 6,
    category: "Наука",
    startYear: 2015,
    endYear: 2022,
    events: [
      {
        id: 1,
        year: 2015,
        description:
          "Первое в истории обнаружение гравитационных волн",
      },
      {
        id: 2,
        year: 2016,
        description:
          "Генная терапия CRISPR впервые испытана на человеке",
      },
      {
        id: 3,
        year: 2016,
        description:
          "Искусственный интеллект побеждает чемпиона мира по игре Go",
      },
      {
        id: 4,
        year: 2017,
        description:
          "Многоразовая ракета Falcon 9 впервые успешно приземлилась (2015) и регулярно использовалась (с 2017)",
      },
      {
        id: 5,
        year: 2019,
        description:
          "Первый снимок чёрной дыры. Удалось визуализировать тень от чёрной дыры в галактике M87",
      },
      {
        id: 6,
        year: 2021,
        description:
          "Запуск космического телескопа Джеймса Уэбба",
      },
    ],
  },
];
